MyMonika/The-hardware-program-of-the-bionic-squid-based-on-STM32ZET6-/HARDWARE/IIC/myiic.c
#include "myiic.h"
#include "delay.h"
#include "sys.h"
#include "usart.h"
#include "stm32f10x.h"
//////////////////////////////////////////////////////////////////////////////////	 
//本程序只供学习使用，未经作者许可，不得用于其它任何用途
//ALIENTEK战舰STM32开发板
//IIC驱动 代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//修改日期:2012/9/9
//版本：V1.0
//版权所有，盗版必究。
//Copyright(C) 广州市星翼电子科技有限公司 2009-2019
//All rights reserved									  
//////////////////////////////////////////////////////////////////////////////////
 
//初始化IIC
void IIC_Init(void)
{					     
	GPIO_InitTypeDef GPIO_InitStructure;
	RCC_APB2PeriphClockCmd(	RCC_APB2Periph_GPIOB, ENABLE );	//使能GPIOB时钟
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C2, ENABLE);   
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10|GPIO_Pin_11;
	//GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6|GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP ;   //推挽输出 （原）
	//GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;  	/* 开漏输出 */
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	GPIO_SetBits(GPIOB,GPIO_Pin_10|GPIO_Pin_11); 	//PB10,PB11 输出高
	//GPIO_SetBits(GPIOB,GPIO_Pin_6|GPIO_Pin_7);
	I2C_Cmd(I2C2,ENABLE);
}
//产生IIC起始信号
void IIC_Start(void)
{
	SDA_OUT();     //sda线输出
	IIC_SDA=1;	  	  
	IIC_SCL=1;
	delay_us(4);
 	IIC_SDA=0;//START:when CLK is high,DATA change form high to low 
	delay_us(4);
	IIC_SCL=0;//钳住I2C总线，准备发送或接收数据 
}	  
//产生IIC停止信号
void IIC_Stop(void)
{
	SDA_OUT();//sda线输出
	IIC_SCL=0;
	IIC_SDA=0;//STOP:when CLK is high DATA change form low to high
 	delay_us(4);
	IIC_SCL=1; 
	IIC_SDA=1;//发送I2C总线结束信号
	delay_us(4);							   	
}
//等待应答信号到来
//返回值：1，接收应答失败
//        0，接收应答成功
u8 IIC_Wait_Ack(void)
{
	u8 ucErrTime=0;
	SDA_IN();      //SDA设置为输入  
	IIC_SDA=1;delay_us(1);	   
	IIC_SCL=1;delay_us(1);	 
	while(READ_SDA)
	{
		ucErrTime++;
		if(ucErrTime>250)
		{
			IIC_Stop();
			return 1;
		}
	}
	IIC_SCL=0;//时钟输出0 	   
	return 0;  
} 
//产生ACK应答
void IIC_Ack(void)
{
	IIC_SCL=0;
	SDA_OUT();
	IIC_SDA=0;
	delay_us(2);
	IIC_SCL=1;
	delay_us(2);
	IIC_SCL=0;
}
//不产生ACK应答		    
void IIC_NAck(void)
{
	IIC_SCL=0;
	SDA_OUT();
	IIC_SDA=1;
	delay_us(2);
	IIC_SCL=1;
	delay_us(2);
	IIC_SCL=0;
}					 				     
//IIC发送一个字节
//返回从机有无应答
//1，有应答
//0，无应答			  
void IIC_Send_Byte(u8 txd)
{                        
    u8 t;   
	SDA_OUT(); 	    
    IIC_SCL=0;//拉低时钟开始数据传输
    for(t=0;t<8;t++)
    {              
        //IIC_SDA=(txd&0x80)>>7;
		if((txd&0x80)>>7)
			IIC_SDA=1;
		else
			IIC_SDA=0;
		IIC_SCL=1;
		delay_us(2);   //对TEA5767这三个延时都是必须的
		txd<<=1; 
		delay_us(2); 
		IIC_SCL=0;	
		delay_us(2);
    }	 
} 	    
//读1个字节，ack=1时，发送ACK，ack=0，发送nACK   
u8 IIC_Read_Byte(unsigned char ack)
{
	unsigned char i,receive=0;
	SDA_IN();//SDA设置为输入
    for(i=0;i<8;i++ )
	{
        IIC_SCL=0; 
        delay_us(2);
				IIC_SCL=1;
        receive<<=1;
        if(READ_SDA)receive++;   
				delay_us(1); 
  }					 
    if (!ack)
        IIC_NAck();//发送nACK
    else
        IIC_Ack(); //发送ACK   
    return receive;
}



uint8_t i2cWrite(uint8_t addr, uint8_t reg, uint8_t data)
{
	  IIC_Init();	
    IIC_Start(); 
		
	  printf("begin\n");
    IIC_Send_Byte(addr | 0x00);
    if (IIC_Wait_Ack()==1) 
			{
        IIC_Stop();
				printf("地址应答no成功\n");
				return 0;
      }
			else
				printf("地址成功应答\n");
		 IIC_Send_Byte(reg);
     if (IIC_Wait_Ack()==1) 
			{
//        i2c_Stop();
				printf("寄存器地址应答no成功\n");
    }
				else
				printf("寄存器地址应答成功\n");
        IIC_Send_Byte(data);
        if (IIC_Wait_Ack()==1) 
			{
//        i2c_Stop();
				printf("数据应答no成功\n");
    }
				else
				printf("数据应答成功\n");
    IIC_Stop();
    return 1;
}



u8 i2c_CheckDevice(uint8_t _Address)
{
	uint8_t ucAck;

	IIC_Init();		/* 配置GPIO */

	IIC_Start();		/* 发送启动信号 */
  
	/* 发送设备地址+读写控制bit（0 = w， 1 = r) bit7 先传 */
        ///////////////////////居然不移位、、、、、、、、、、、、
	IIC_Send_Byte(_Address<<1 | 0x00);
	ucAck = IIC_Wait_Ack();	/* 检测设备的ACK应答 */
	IIC_Stop();			/* 发送停止信号 */
        if(!ucAck){
          printf("同地址为%d的PCA9685通讯成功\r\n",_Address);
					return 1;
				}
				else
				{
					printf("通讯失败");
					return 0;
				}
}









































